{
  "subtitle": "Design, words, images",
  "name": "Miguel",
  "lastname": "Esquirol",
  "pages": {
    "about":"About",
    "education":"Education",
    "employment":"Experience",
    "workflow":"Workflow",
    "skills":"Skills",
    "interests":"Interests"
  },
  "email": "miguelesquirol@gmail.com",
  "phone": "5145678197",
  "url": "http://miguelesquirol.com",
  "languages": "Spanish, English, French",
  "twitter": "https://twitter.com/miguelesquirol",
  "linkedin": "https://www.linkedin.com/in/miguel-esquirol-94289337/",
  "github": "https://github.com/miguelesquirol",
  "instagram": "https://www.instagram.com/miguelesquirol",
  "welcome_message": "I've been programming from more than 20 years, I started with basic html in old Netscape browser in a clunky machine, learned CSS, moved from flash to HTML5, from tables and iframes to responsive sites, jQuery and CSS3 animations to the latest frameworks like React or Vue. Since 2009 I started to work as webdesigner professionally, with small projects in an independent manner, designing, coding and hosting websites. Since 2013 I've been working full time as front-end developer. Today I create useful pages for people, developing full fledged websites and apps, and working in a company with big clients and hundres of thousands of users. Web design is still growing, and I plan to keep on learning.",
  "general": {
    "company": "Company",
    "stack": "Stack",
    "languages": "languages",
    "clients": "clients"
  },
  "education": {
    "title-section": "Education",
    "school1": {
      "school": "The Ohio State University",
      "title": "Master of  Arts (MA) ",
      "year": "2008"
    },
    "school2": {
      "school": "Universitat Ramón Llull",
      "title": "Post-degree",
      "year": "2006"
    },
    "school3": {
      "school": "Universidad Católica Boliviana",
      "title": "Bachelor of Arts ",
      "year": "2002"
    }
  },
  "employment": {
    "title-section": "Experience",
    "company1": {
      "title": "Front End Developer",
      "name": "Global Eagle",
      "url": "http://www.globaleagle.com",
      "period": "2018 > present",
      "stack": [
        "angular",
        "react",
        "sass",
        "python",
        "linux",
        "terminal fas"
      ],
      "description": "Global Eagle is a leading worldwide provider of inflight entertainment, media content, technology and connectivity solutions to the airline industry. I worked in the delivery team bringing to the Airlines the portal that the passengers will see when they connect to the Wifi on the plane. My role included adapt the theme for the specific client using SASS and GIT, locate and fix bugs working with the QA and Backend department. I translated design to code and modified extensively the look and feel of the portal. I reviewd and implement changes, build packages including front and backend, and deployed them into the Development, Staging and Production Servers. I prepared files and scripts for deployment on the plane. I worked with other teams in our office and in the international offices to present a product that thousands of people will use and enjoy.",
      "client1": {
        "name": "Air France",
        "image": "",
        "description": "I adapted the main portal for the specific needs of this client. I helped implement new features (Live TV, Games, etc.). I prepared the files that the QA will review and later that the planes will have installed.",
        "url": "https://www.airfrance.ca/CA/fr/common/ife/dispatch/tous_les_films.htm"
      },
      "client2": {
        "name": "Southwest",
        "image": "",
        "description": "I updated the look and feel of the portal with a complete overhaul of UI/UX desgin, adapting the Designs from the Design Team into the actual code. I worked with SASS and Python to achieve the expected result. I've helped to create new features, and fix the issues that the client found",
        "url": "https://www.southwest.com/wifi/"
      },
      "client3": {
        "name": "Fly Dubai",
        "image": "",
        "description": "I was the main front-end developer assigned to this client, setting up the project from scratch, and adapting the Portal with the needs of the client. From start to deployment I worked closely with the Product Manager, and the Backend Team to locate and fix issues",
        "url": "https://www.flydubai.com/en/"
      },
      "client4": {
        "name": "United Airways",
        "image": "",
        "description": "Built on React, we created a website to present the Airline offers on inflight entertainment. I worked to make this site fully accessible following the client requirements",
        "url": "http://unitedprivatescreening.com/"
      }
    },
    "company2": {
      "title": "Front End Developer",
      "name": "Nventive",
      "url": "http://www.nventive.com",
      "period": "2017 > 2018",
      "stack": [
        "Vuejs",
        "Symfony",
        "Drupal",
        "Wordpress",
        "Sass"
      ],
      "description" : "Agency that creates cross platform native mobile and web apps with major tech clients. I worked in a highly skilled team environment with top software developers.",
      "client1": {
        "name": "National Geograhic",
        "image": "",
        "description": "We created a website to showcase their latest project. A tool to learn english using Ted Talks. The site was completely created on VUE with a Django backend and animations using GreenSock JS.",
        "url": "https://eltngl.com/learnenglishwithtedtalks/#home"
      },
      "client2": {
        "name": "CAA",
        "image": "I worked with the team suporting CAA, an automotive, travel, residential and insurance products. With a complex network of websites I helped maintain and develop new features.",
        "description": "",
        "url": "https://www.caaquebec.com"
      },
      "client3": {
        "name": "College de Rosemont",
        "image": "",
        "description": "I worked almost completely alone as a Frontend of this client developing their main website. We used a heavily modified Wordpress instalation with custom code made with PHP. Working together with the Designer and the product manager we had to create a wide variety of pages that showcase everything this university has to offer",
        "url": "https://www.crosemont.qc.ca/"
      },
      "client4": {
        "name": "Cineplex",
        "image": "",
        "description": "I worked in the Frontend team developing the style and main frontend elements for the website of one of the biggest Cinema Chain in Canada. I helped create the Atomic Framework based on the Atomic Design philosophy that later the Backend team used to create the site.",
        "url": "https://www.cineplex.com/"
      }
    },
    "company3": {
      "title": "Web Designer",
      "name": "Link Now Media",
      "url": "http://www.linknow.com",
      "period": "2012 > 2017",
      "stack": [
        "CSS3",
        "HTML5",
        "Js-square",
        "Wordpress",
        "PHP",
        "Paypal"

      ],
      "description": "<ul> <li>LinkNow Media develops websites and digital marketing solutions for over 10,000+ clients throughout the United States and Canada</li><li>I was designer with thousands of clients, small companies across the US and Canada.</li><li>I was responsible of design, code and client contact of each of them</li><li>Starting with a homegrown framework in Wordpress I designed and coded thousands of different websites.</li><li>I was responsible of e-commerce sites on several accounts.</li><li>I trained new junior designers on procedures, design and standards.</li><li>I was the designer with the most clients and responsibilities on the company at the moment of leaving.</li></ul>"
    },
    "company4": {
      "title": "Independent Web Designer",
      "name": "",
      "url": "",
      "period": "",
      "stack": [
        "HTML5",
        "CSS3",
        "PHP",
        "Wordpress"
      ],
      "description": "I worked directly with a graphic designer on different personal projects, non profit companies, and independent clients.  I had the complete control of the code and the design of the site, as well as the hosting, maintenance and regular updates of the sites. I developed portfolios for close friends, and created personal projects trying to bring people together.",
      "client1": {
        "name": "CSJR",
        "image": "",
        "description": "The CSJR (Centre for Services in Restorative justice) is the bilingual site for a non-profit project that relies on encounters between persons who directly or indirectly, have suffered or committed crimes of a similar nature in order to restore together the damage done by the crime. I worked on this project, replacing the original site they had with a new more modern one. From design (together with a graphic designer), to coding, hosting and maintenance, the site is built on Wordpress with custom PHP code (without builders), with security and multilingual supprot.",
        "url": "http://www.csjr.org/"
      }
    }
  },
  "other-employment": {
    "title": "Other Professional Experience",
    "description": "<ul><li>I've been spanish teacher for adults in a Montreal institute and at university level at Ohio State University in Columbus, OH <li>I have a spanish masters with experience in journalism and translation.</li> <li>Manager of several web-pages and online communities working both in content and design as well as the first Blog in Bolivia and the first database of bloggers on the same country.</li> <li>Worked with Databases (MySQL) and phpMyadmin for Wordpress based webpages and others.</li> <li>Installation of XAMPP and LAMP servers.</li> <li>Worked as Information Technology Assistant, at the Universitat de Barcelona in Spain helping teachers and the administrative personal with their computers</li> <li>Installed and fixed Windows and Mac computers and set-up class rooms with dozens of computers with the required software.</li> <li>Built and help maintain the computers and the network for a cibercafe I was co-owner, as well as to answer client requests and questions.</li> <li>Published daily for a year articles about software and technology for a developers community.</li> <li>I discovered and tested software, wrote manuals and how-to, and answered questions from the members of the community and help maintain it and make it grow.</li> <li>I've been using Linux for over 15 years, testing new software and promoting open source environments, but I’m familiar with other environments and OS.</li> <li>My software of choice for coding (for the moment) is PyCharm, Git, npm, and Firefox . I'm also proficient at Photoshop and Illustrator for design (and their Opensource equivalents, Gimp and Inkscape). I’m flexible and learn quickly and love to do research.</li></ul>"
  },
  "skills": {
    "title-section": "Skills",
    "description": "<ul><li>Mobile-First, Responsive Design</li><li>Cross Browser Testing &amp; Debugging (Desktop and Mobile)</li><li>Cross Functional Teams</li><li>Agile Development &amp; Scrum</li><li>Organized and fast</li><li>Atention to detail</li><li>Some design skills with the Adobe Suite</li></ul>",
    "programming": [
      "CSS",
      "SASS",
      "HTML5",
      "PHP",
      "Javascript",
      "jQuery",
      "Bootstrap",
      "Foundation",
      "npm",
      "git"
    ]
  },
  "interests": {
    "title-section": "Interests",
    "description": "Outside of programming, my hobbies are mainly cooking, being with the family and learning new things. I like photography, to work with wood, read and travel. I have published a couple of books and numerous anthologies. For the past few months I have started to teach myself to draw. Drawing with pencil, ink and watercolor."
  }
}
