{
  "subtitle": "Diseño, palabras, imágenes",
  "name": "Miguel",
  "lastname": "Esquirol",
  "pages": {
    "about":"Acerca de",
    "education":"Education",
    "employment":"Empleo",
    "workflow":"Workflow",
    "programming":"Programación",
    "interests":"Intereses"
  },
  "email": "miguelesquirol@gmail.com",
  "phone": "5145678197",
  "url": "http://miguelesquirol.com",
  "languages": "español, inglés, francés",
  "twitter": "https://twitter.com/miguelesquirol",
  "linkedin": "https://www.linkedin.com/in/miguel-esquirol-94289337/",
  "github": "https://github.com/miguelesquirol",
  "instagram": "https://www.instagram.com/miguelesquirol",
  "welcome_message": "He programado desde hace más de 20 años, comencé con html básico en el viejo navegador Netscape en una máquina lenta, aprendí CSS, pasé de flash a HTML5, de tablas e iframes a sitios responsivos, jQuery y CSS3 animaciones a los marcos más recientes como React o Vue. Desde 2009 comencé a trabajar como diseñador web profesionalmente, con pequeños proyectos de forma independiente, diseñando, programando y alojando sitios web. Desde 2013 he trabajado a tiempo completo como desarrollador front-end. Hoy creo páginas útiles para las personas, desarrollando sitios web y aplicaciones completos, actualmente trabajando en una empresa con grandes clientes y cientos de miles de usuarios. El diseño web sigue creciendo y planeo seguir aprendiendo.",
  "general": {
    "company": "Compañía",
    "stack": "Stack",
    "languages": "Idiomas",
    "clients": "Clientes"
  },
  "education": {
    "title-section": "Educacion",
    "school1": {
      "school": "The Ohio State University",
      "title": "Masteria ",
      "year": "2008"
    },
    "school2": {
      "school": "Universitat Ramón Llull",
      "title": "Postgrado",
      "year": "2006"
    },
    "school3": {
      "school": "Universidad Católica Boliviana",
      "title": "Licenciatura",
      "year": "2002"
    }
  },
  "employment": {
    "title-section": "Experiencia",
    "company1": {
      "title": "Front End Developer",
      "name": "Global Eagle",
      "url": "http://www.globaleagle.com",
      "period": "2018 > present",
      "stack": [
        "fa-angular",
        "fa-react",
        "fa-sass",
        "fa-python",
        "fa-linux"
      ],
      "description": "Global Eagle es un proveedor líder mundial de soluciones de entretenimiento, contenido multimedia, tecnología y conectividad a bordo para la industria de las aerolíneas. Trabajé en el equipo de entrega llevando a las aerolíneas el portal que los pasajeros verán cuando se conecten al Wifi en el avión. Mi función incluía adaptar el tema para el cliente específico usando SASS y GIT, localizar y corregir errores trabajando con el departamento de control de calidad y backend. Traduje el diseño al código y modifiqué ampliamente la apariencia del portal. e implementar cambios, construir paquetes que incluyen front-end y backend, y desplegarlos en los servidores de desarrollo, preparación y producción. Preparé archivos y scripts para su despliegue en el avión. Trabajé con otros equipos en nuestra oficina y en las oficinas internacionales para presentar un producto que miles de personas usarán y disfrutarán.",
      "client1": {
        "name": "Air France",
        "image": "",
        "description": "Adapté el portal principal para las necesidades específicas de este cliente. Ayudé a implementar nuevas funciones (TV en vivo, juegos, etc.). Preparé los archivos que el QA revisará y luego los aviones se habrán instalado.",
        "url": "https://www.airfrance.ca/CA/fr/common/ife/dispatch/tous_les_films.htm"
      },
      "client2": {
        "name": "Southwest",
        "image": "",
        "description": "Actualicé el aspecto del portal con una revisión completa del diseño de UI / UX, adaptando los diseños del equipo de diseño al código real. Trabajé con SASS y Python para lograr el resultado esperado. He ayudado a crear nuevas funciones y a solucionar los problemas que el cliente encontró",
        "url": "https://www.southwest.com/wifi/"
      },
      "client3": {
        "name": "Fly Dubai",
        "image": "",
        "description": "Fui el principal desarrollador front-end asignado a este cliente, configuré el proyecto desde cero y adapté el Portal a las necesidades del cliente. Desde el inicio hasta la implementación, trabajé estrechamente con el Product Manager y el equipo de backend para localizar y solucionar problemas",
        "url": "https://www.flydubai.com/en/"
      },
      "client4": {
        "name": "United Airways",
        "image": "",
        "description": "Desarrollado en React, creamos un sitio web para presentar las ofertas de la aerolínea en entretenimiento a bordo. Trabajé para que este sitio fuera totalmente accesible siguiendo los requisitos del cliente",
        "url": "http://unitedprivatescreening.com/"
      }
    },
    "company2": {
      "title": "Front End Developer",
      "name": "Nventive",
      "url": "http://www.nventive.com",
      "period": "2017 > 2018",
      "stack": [
        "fa-vuejs",
        "fa-symfony",
        "fa-drupal",
        "fa-wordpress",
        "fa-sass"
      ],
      "description" : "\"Agencia que crea aplicaciones móviles y web nativas multiplataforma con los principales clientes tecnológicos. Trabajé en un entorno de equipo altamente calificado con los principales desarrolladores de software.",
      "client1": {
        "name": "National Geograhic",
        "image": "",
        "description": "Creamos un sitio web para mostrar su último proyecto. Una herramienta para aprender inglés usando Ted Talks. El sitio fue creado completamente en VUE con un backend de Django y animaciones usando GreenSock JS.",
        "url": "https://eltngl.com/learnenglishwithtedtalks/#home"
      },
      "client2": {
        "name": "CAA",
        "image": "Trabajé con el equipo de soporte de CAA, un producto automotriz, de viajes, residencial y de seguros. Con una red compleja de sitios web ayudé a mantener y desarrollar nuevas funciones.",
        "description": "",
        "url": "https://www.caaquebec.com"
      },
      "client3": {
        "name": "College de Rosemont",
        "image": "",
        "description": "Trabajé casi completamente solo como Frontend de este cliente desarrollando su sitio web principal. Utilizamos una instalación de Wordpress muy modificada con código personalizado hecho con PHP. Trabajando junto con el Diseñador y el gerente de producto tuvimos que crear un amplio variedad de páginas que muestran todo lo que esta universidad tiene para ofrecer.",
        "url": "https://www.crosemont.qc.ca/"
      },
      "client4": {
        "name": "Cineplex",
        "image": "",
        "description": "Trabajé en el equipo Frontend desarrollando el estilo y los principales elementos frontend para el sitio web de una de las cadenas de cine más grandes de Canadá. Ayudé a crear el Marco Atómico basado en la filosofía de Diseño Atómico que luego el equipo Backend solía crear el sitio.",
        "url": "https://www.cineplex.com/"
      }
    },
    "company3": {
      "title": "Web Designer",
      "name": "Link Now Media",
      "url": "http://www.linknow.com",
      "period": "2012 > 2017",
      "stack": [
        "fa-css3",
        "fa-html5",
        "fa-js-square",
        "fa-wordpress",
        "fa-php",
        "fa-paypal"
      ],

      "description": "<ul> <li>LinkNow Media desarrolla sitios web y soluciones de marketing digital para más de 10,000 clientes en todo Estados Unidos y Canadá </li><li> Fui diseñador con miles de clientes, pequeñas empresas en los Estados Unidos y Canadá. </li> <li> Fui responsable del diseño, el código y el contacto con el cliente de cada uno de ellos </ li> <li> Comenzando con un marco de producción propia en Wordpress, diseñé y codifiqué miles de sitios web diferentes. </li> <li> Fui responsable de sitios de comercio electrónico en varias cuentas. </li> <li> Capacité a nuevos diseñadores junior en procedimientos, diseño y estándares. </li> <li> Yo era el diseñador con más clientes y responsabilidades en la empresa al momento de salir. </li> </ul>"
    },
    "company4": {
      "title": "Diseñador web independiente",
      "name": "",
      "url": "",
      "period": "",
      "stack": [
        "fa-html5",
        "fa-css3",
        "fa-php",
        "fa-wordpress"
      ],
      "description": "Trabajé directamente con un diseñador gráfico en diferentes proyectos personales, compañías sin fines de lucro y clientes independientes. Tuve el control completo del código y el diseño del sitio, así como el alojamiento, mantenimiento y actualizaciones periódicas de los sitios. Desarrollé carteras para amigos cercanos, y creé proyectos personales tratando de unir a las personas.",
      "client1": {
        "name": "CSJR",
        "image": "",
        "description": "El CSJR (Centro de Servicios de Justicia Restaurativa) es el sitio bilingüe para un proyecto sin fines de lucro que se basa en encuentros entre personas que directa o indirectamente, han sufrido o cometido delitos de naturaleza similar para restaurar juntos el daño causado por el crimen. Trabajé en este proyecto, reemplazando el sitio original que tenían por uno nuevo más moderno. Desde el diseño (junto con un diseñador gráfico), hasta la codificación, el alojamiento y el mantenimiento, el sitio está construido en Wordpress con código PHP personalizado (sin constructores), con seguridad y soporte multilingüe .",
        "url": "http://www.csjr.org/"
      },
       "client2": {
        "name": "Cocineros Globales",
        "image": "",
        "description": "Trabajando con una periodista de la india, desarrollamos un citio web en el que la gente podía compartir recetas y la experiencia de cocinar esas recetas con todo el mundo. Conseguimos cocineros de diferentes nacionalidades para compartan su experiencia con nosotros.",
        "url": ""
      }
    }
  },
  "other-employment": {
    "title": "Other Professional Experience",
    "description": "<ul> <li> He sido profesor de español para adultos en un instituto de Montreal y a nivel universitario en la Ohio State University en Columbus, OH <li> Tengo una maestría en español con experiencia en periodismo y traducción. </li> <li>Fui administrador de varias páginas web y comunidades en línea que trabajan tanto en contenido como en diseño, así como el primer Blog en Bolivia y la primera base de datos de blogueros en el mismo país. </li> <li> Trabajé con Bases de datos (MySQL) y phpMyadmin para páginas web basadas en Wordpress y otros. </li> <li> Trabajé como Asistente de Tecnología de la Información, en la Universitat de Barcelona en España, ayudando a maestros y el personal administrativo con sus computadoras </li> <li> Instalé y reparé computadoras Windows y Mac y configuré salones de clase con docenas de computadoras con el software requerido. </li> <li> Construí y ayudé a mantener las computadoras y fui copropietario de un cibercafé, . </li> <li> Publiqué diariamente durante un año artículos sobre software y tecnología para una comunidad de desarrolladores frances/canadience. </li> <li> Descubrí y probé software, escribí manuales y procedimientos, y respondí preguntas de los miembros del comunidad y ayudé a mantenerla y hacerla crecer. </li> <li> He estado usando Linux durante más de 15 años, probando software nuevo y promoviendo entornos de código abierto, pero estoy familiarizado con otros entornos y sistemas operativos. </ li> <li> Mi software preferido para la programacion (por el momento) es PyCharm, Git, npm y Firefox. También soy experto en Photoshop e Illustrator para el diseño (y sus equivalentes de Opensource, Gimp e Inkscape).</li> <li> Soy flexible y aprendo rápidamente y me encanta investigar. </li> </ul>"

  },
  "skills": {
    "title-section": "Skills",
    "description": "<ul> <li> Diseño responsivo móvil-first</li> <li> Pruebas cruzadas de navegador y depuración de bugs (escritorio y móvil ) </li> <li> Equipos multifuncionales </li> < li> Desarrollo ágil y scrum </li> <li> Organizado y rápido </li> <li> Atención a los detalles </li> <li> Algunas habilidades de diseño con Adobe Suite </li> </ul>",
    "programming": [
      "CSS",
      "SASS",
      "HTML5",
      "PHP",
      "Javascript",
      "jQuery",
      "Bootstrap",
      "Foundation",
      "npm",
      "git"
    ]
  },
  "interests": {
    "title-section": "Intereses",
    "description": "Fuera de la programación, mis pasatiempos son principalmente cocinar, estar con la familia y aprender cosas nuevas. Me gusta la fotografía, trabajar con madera, leer y viajar. He publicado un par de libros y numerosas antologías. Durante los últimos meses he comenzado a enseñarme a dibujar. Dibujo con lapiz, tinta y acuarela."
  }
}
